server/app/Controllers/Login.php

    public function index()
    {
        $userModel = new UserModel();
        $input = $this->request->getJSON(true);

        // Retrieve input data
        $email = $input['email'] ?? '';
        $password = $input['password'] ?? '';

        // Validate the input
        if (!$email || !$password) {
            return $this->fail('Email and password are required.', 400);
        }

        // Check if the user exists
        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'hasan.visionx@gmail.com'
 LIMIT 1