server/app/Controllers/Register.php

SELECT *
FROM `users`
WHERE `email` = 'hani30.can@gmail.com'
 LIMIT 1
---
    public function index()
    {
        echo "register method is called";
        $userModel = new UserModel();

        // Retrieve input data
        $username = $this->request->getVar('username');
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        log_message('debug', 'Register input - Username: ' . $username . ', Email: ' . $email);

        // Validate the input
        if (!$username || !$email || !$password) {
            return $this->fail('All fields are required.', 400);
        }

        // Check if the user already exists
        if ($userModel->where('email', $email)->first()) {

INSERT INTO `users` (`username`, `email`, `password`, `created_at`, `updated_at`) VALUES ('hani30.can@gmail.com', 'hani30.can@gmail.com', '$2y$10$v3anoufZUvoZTY2DOd9Mnev1I3yRxvfzSCYXIDvksZ0A.nd042lge', '2024-10-01 18:20:04', '2024-10-01 18:20:04')
---
            'updated_at' => date('Y-m-d H:i:s'),
        ];

        if ($userModel->insert($userData)) {